homebug/arduino-board-definitions/Homebug/hardware/samd/1.8.3/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA



# Homebug Ebug v3.0
# --------------------------------------
ebug3_0.name=Homebug Ebug v3.0 (Native USB Port)
ebug3_0.vid.0=0x2341
ebug3_0.pid.0=0x804d
ebug3_0.vid.1=0x2341
ebug3_0.pid.1=0x004d

ebug3_0.vid.2=0x2341
ebug3_0.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
ebug3_0.vid.2.build.vid=0x2341
ebug3_0.vid.2.build.pid=0x824d
ebug3_0.vid.2.build.usb_product="Ebug v3.0"

ebug3_0.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

ebug3_0.vid.3=0x2341
ebug3_0.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
ebug3_0.vid.3.build.vid=0x2341
ebug3_0.vid.3.build.pid=0x824d
ebug3_0.vid.3.build.usb_product="Ebug v3.0"
ebug3_0.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

ebug3_0.upload.tool=bossac
ebug3_0.upload.protocol=sam-ba
ebug3_0.upload.maximum_size=262144
ebug3_0.upload.use_1200bps_touch=true
ebug3_0.upload.wait_for_upload_port=true
ebug3_0.upload.native_usb=true
ebug3_0.build.mcu=cortex-m0plus
ebug3_0.build.f_cpu=48000000L
ebug3_0.build.usb_product="Ebug v3.0"
ebug3_0.build.usb_manufacturer="Homebug"
ebug3_0.build.board=EBUG3_0
ebug3_0.build.core=arduino
ebug3_0.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
ebug3_0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
ebug3_0.build.openocdscript=openocd_scripts/arduino_zero.cfg
ebug3_0.build.variant=ebug3_0
ebug3_0.build.variant_system_lib=
ebug3_0.build.vid=0x2341
ebug3_0.build.pid=0x804d
ebug3_0.bootloader.tool=openocd
ebug3_0.bootloader.file=zero/samd21_sam_ba.bin

